# WORA(Write Once, Run Anywhere)
#   원래는 시스템별로 프로그램 따로 만들어야
#   프로그램 하나 만들어놓으면 어떤 시스템이든 다 돌아가는

# WORA가 의미가 있나
#   1) 요즘 나오는 언어는 기본사항
#   2) 진짜 WORA? : 경로 같은 거는 시스템별로 다르니니

# 확장자 : MS Windows에만 있는 허상
#   파일의 정체를 대충 짐작하게 해주는
#   .txt : 메모장에서 열면 잘 열릴 것 같은 파일
#   .xls : 엑셀에서 열면 잘 열릴 것 같은 파일
#   .ppt : 파워포인트에서 열면 잘 열릴 것 같은 파일
#   .csv : 엑셀파일 x

# 경로
#   Windows : 대소문자 구별 x, \, 드라이브
#   Linux : 대소문자 구별, /, 드라이브 개념 x

# ㅋㅋㅋ -인코딩-> 10110101 -디코딩-> ㅋㅋㅋ
# 인코딩 방식이 여러 종류
#   utf-8 : 전세계적으로 주력(Linux가 주로 써서)
#   euc-kr

# 데이터    -> 임시저장 : 변수형태로 RAM에 저장
#           -> 영구저장 : 파일형태로 SSD/HDD에 저장
txt = input("뭐 : ")

# 파일 열기(드라이브, 폴더는 안 만들어줌)
f = open("C:\\ljw\\0325.txt", "a", encoding="utf-8")
                            # r : read 
                            # w : write(기존 거 지우고)
                            # a : append(기존 거 뒤에)
f.write(txt + "\r\n")
f.close()