# C는 많아질테고
# 프로그램의 첫 진입점 역할하는 C
#   HomeController, MainController

###########################################
# V는 Python 콘솔창
# 앞으로는 V가 웹사이트, 스마트폰 앱화면, ...
#   딱히 바꿀 이름은...

###########################################
# M은 자유롭게 이름

###########################################
###########################################
# DAO/DTO 패턴
#   MVC 패턴인데
#   M 중에 DB 관련 작업하는 :
#       DAO(Data Access Object)
#   M-V-C 간에 왔다갔다하는 데이터 :
#       DTO(Data Temp/Transfer Object)

###########################################
###########################################
# AOP
#   DB 작업 때마다 연결/cur 만들고, 닫고는 늘 해야 하는 작업
#   이번 프로젝트만? -> 모든 프로젝트가 다 필요 -> library로 만들자