# Python의 특징
#   - 효율적인 프로그램 개발 < 사람 작업하기 편한
#   - 자유의 언어 -> 혼란
#   - 개발자들이 많아 -> 만든 거 공유하는 문화
#       -> 남의 작업물 잘 갖다 쓰자
#       -> 이름중복이 빈번할텐데 구분할 수단이 필요함
#           : package : 패키지명도 중복되면? 망하지만
#               그래도 Python은 자유롭게 패키지명을
#########################
# package(선택사항) - module(.py(필수사항)) - class(선택사항)
# OOP의 권장사항 : 1 file에 1 class인데, Python은 무관심
# package 써가면서 module 좀 나누자
#########################
# package : VScode에서는 폴더로 만들고
#   무조건 __init__.py 파일이 필요함(VScode에서는 직접 만들어야 함)
#########################
# import
#       선택사항 : 안 해도 되는데, 하면 문법이 간단해짐
#       필수사항
# Python은 다른 모듈에 있는 거 불러오려면 무조건 해야 함