# compiler 방식 언어(일반적인 PL들)
#   한국어 -번역(coding)-> 프로그램 소스      : 개발자
#   프로그램 소스 -번역(compile)-> 기계어     : 언어가 알아서
#   기계어 -압축(packaging)-> 최종 실행 파일  : 개발자가 툴 써서
#   최종 실행 파일 -실행->                    : 사용자

# interpreter 방식 언어(Python)
#   한국어 -번역(coding)-> 프로그램 소스      : 개발자
#   프로그램 소스 -실행->                     : 사용자
#       소스 한 줄 기계어로 번역해서 실행하고  : 언어가 알아서
#       그 다음 줄 기계어로 번역해서 실행하고
#       ...
#   => error/exception 구별이 힘듦 => 에러 잡기 힘듦

# error :
#   프로그램 소스가 이상해서 기계어로 번역 불가능한 거
#   compile 불가능한 거
#   최종 실행 파일이 안 나옴 -> 실행 불가
#   개발자 잘못

# warning : 지저분한 소스
#   불필요한 작업, 쓰고 정리 안 함 -> 지저분한 소스
#   실행 가능
#   개발자 잘못

# exception : 
#   프로그램 완성, 실행 잘 됨
#   실행할 때 뭔가 외부적 요인 때문에 정상 실행이 안 되는 상황
#   개발자 잘못은 아닌데, 해결해줄 수 있는 게 개발자뿐
#   -> 개발자가 대비는 해둘 필요가